app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "category" = ?, "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["category", "テスト更新"], ["body", "テスト更新"], ["updated_at", "2020-11-23 10:55:52.862916"], ["id", 1]]
---
  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)